---
title: ColumnFailures
classe: Autodesk.Revit.DB.BuiltInFailures+ColumnFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# ColumnFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId ColumnAndTargetAreConcrete { get; }` | `ColumnFailures.ColumnAndTargetAreConcrete` | FailureDefinitionId |
| `FailureDefinitionId ColumnBaseAboveTopError { get; }` | `ColumnFailures.ColumnBaseAboveTopError` | FailureDefinitionId |
| `FailureDefinitionId ColumnBaseAboveTopFailure { get; }` | `ColumnFailures.ColumnBaseAboveTopFailure` | FailureDefinitionId |
| `FailureDefinitionId ColumnJoinNonhitFailure { get; }` | `ColumnFailures.ColumnJoinNonhitFailure` | FailureDefinitionId |
| `FailureDefinitionId ColumnTopBelowBaseError { get; }` | `ColumnFailures.ColumnTopBelowBaseError` | FailureDefinitionId |
| `FailureDefinitionId ColumnTopBelowBaseFailure { get; }` | `ColumnFailures.ColumnTopBelowBaseFailure` | FailureDefinitionId |
| `FailureDefinitionId ColumnZeroHeightError { get; }` | `ColumnFailures.ColumnZeroHeightError` | FailureDefinitionId |
| `FailureDefinitionId ColumnZeroHeightFailure { get; }` | `ColumnFailures.ColumnZeroHeightFailure` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```